/*********************************************************************************************************************
* @file            car_init.c
* @author          Davis Klay HF
* @Target core     GD32E230C8T6
* @revisions       -2021.10.7, V1.0
*                  -2021.10.24, V1.1
* @modify          修改了car_init函数的注释部分，对每类子函数都添加了注释
********************************************************************************************************************/

#include "car_init.h"

//-------------------------------------------------------------------------------------------------------------------
// @brief        智能车初始化
// @param        void    
// @return       void
// Sample usage:        car_init(); 
                        //智能车初始化
//-------------------------------------------------------------------------------------------------------------------
void car_init(void)
{
    systick_config();							//时钟初始化
	
	uart0_init(UART0);							//串行口初始化
	//AD采样通道初始化  
	adc_channel_init(ADC_CH_01);	
	delay_1ms(5);
	adc_channel_init(ADC_CH_04);
	delay_1ms(5);
	adc_channel_init(ADC_CH_05);

    key_init(K1);								//4按键初始化
    key_init(K2);
    key_init(K3);
    key_init(K4);

	buzzer_init();								//蜂鸣器初始化
	
	reed_init();								//干簧管初始化
	
    l9110s_init(left);							//左电机初始化
    l9110s_init(right);							//右电机初始化
	
    ws2812b_init();								//RGB灯初始化
    car_both_rgb_off();
	
	tm1637_init();								//数码管初始化
	
	ultra_init();								//超声波初始化

    int_init();									//中断初始化
}

//其它的初始化均可由用户自行在下方编写，并添加在car_init()函数中
//例如：中断初始化等
//-------------------------------------------------------------------------------------------------------------------
// @brief        中断初始化
// @param        void    
// @return       void
// Sample usage:        int_init();//中断初始化
//-------------------------------------------------------------------------------------------------------------------
void int_init(void)
{
    ;
}
