/*********************************************************************************************************************
* @file            main.h
* @author          Davis Klay HF
* @Target core     GD32E230C8T6
* @revisions       -2021.10.7, V1.0
* @modify          none
********************************************************************************************************************/

#ifndef _MAIN_H
#define _MAIN_H

//说明：该文件用于存放用户在main函数中用到的变量定义、宏定义、函数声明等内容

#include "headfile.h"

//宏定义


//函数声明


//全局变量声明

#endif
