/*********************************************************************************************************************
* @file            HF_TM1637.c
* @author          Davis Klay HF
* @Target core     GD32E230C8T6
* @revisions       -2021.10.7, V1.0
* @modify          none
********************************************************************************************************************/

#include "HF_TM1637.h"

//-------------------------------------------------------------------------------------------------------------------
// @brief        数码管初始化
// @param        void
// @return       void
// Sample usage:        tm1637_init();//初始化数码管
//-------------------------------------------------------------------------------------------------------------------
void tm1637_init(void)
{
    /* 配置PB6、PB7接口 */
    gpio_init(GPIOB , OUT_PP, GPIO_PIN_6);
    gpio_init(GPIOB , OUT_PP, GPIO_PIN_7);
}

//-------------------------------------------------------------------------------------------------------------------
// @brief        起始信号
// @param        void
// @return       void
// Sample usage:        tm1637_start();//起始信号
//-------------------------------------------------------------------------------------------------------------------
void tm1637_start(void)
{
    led_scl_set();      //SCL为高电平
    led_sda_set();      //SDA为高电平
    delay_1us(125);
    led_sda_clr();      //SDA为低电平
    delay_1us(75);
    led_scl_clr();      //SCL为低电平
    delay_1us(25);
}

//-------------------------------------------------------------------------------------------------------------------
// @brief        等待应答，不对ACK信号做响应
// @param        void
// @return       void
// Sample usage:        tm1637_wait_ack();//等待应答
//-------------------------------------------------------------------------------------------------------------------
void tm1637_wait_ack(void)
{
    led_scl_clr();      //SCL为低电平
    led_sda_clr();      //SDA为低电平
    delay_1us(50);
    led_scl_set();      //SCL为高电平
    delay_1us(25);
    led_scl_clr();      //SCL为低电平
    delay_1us(25);
}

//-------------------------------------------------------------------------------------------------------------------
// @brief        停止信号
// @param        void
// @return       void
// Sample usage:        tm1637_stop();//停止信号
//-------------------------------------------------------------------------------------------------------------------
void tm1637_stop(void)
{
    delay_1us(25);
    led_scl_set();      //SCL为高电平
    led_sda_clr();      //SDA为低电平
    delay_1us(75);
    led_sda_set();      //SDA为高电平
}

//-------------------------------------------------------------------------------------------------------------------
// @brief        写一个字节，用于数码管不同字符的显示
// @param        void
// @return       void
// Sample usage:        tm1637_write_byte(0xFF);//向数码管写0xFF字节,点亮八个灯区
//-------------------------------------------------------------------------------------------------------------------
void tm1637_write_byte(unsigned char dat)
{
    unsigned char i;
	
    for(i=0; i<8; i++)
    {
        led_scl_clr();      //SCL为低电平
		
        if(dat & 0x01) //低位在前
        {
            led_sda_set();      //SDA为高电平
        }
        else
        {
            led_sda_clr();      //SDA为低电平
        }
		
        delay_1us(25);
        dat = dat >> 1;
        led_scl_set();      //SCL为高电平
        delay_1us(50);
        led_scl_clr();      //SCL为低电平
        delay_1us(50);
    }
}

//-------------------------------------------------------------------------------------------------------------------
// @brief        发送一个命令，模拟模拟开始、写入、等待、结束过程
// @param        void
// @return       void
// Sample usage:        tm1637_command(0x40);//向数码管发送一个命令（设置为地址自动加一显示）
//-------------------------------------------------------------------------------------------------------------------
void tm1637_command(unsigned char cmd)
{
    tm1637_start();
    tm1637_write_byte(cmd);
    tm1637_wait_ack();
    tm1637_stop();
}

//-------------------------------------------------------------------------------------------------------------------
// @brief        数码管逐位显示
// @param        num_position  数字的位置    num_position = 1..4
// @param        num           显示的数字    num = 0..9
// @param        dp            是否有小数点  dp = 0,1  //dp=0表示没有小数点，=1则表示有小数点
// @return       void
// Sample usage:        tm1637_leddisplay(1, 1, 0);//在第一位（从右往左数位数逐渐增大）显示数字1，不带小数点
//-------------------------------------------------------------------------------------------------------------------
void tm1637_leddisplay(unsigned char num_position, unsigned char num, unsigned char dp)
{  
    tm1637_start();    
    tm1637_write_byte(0xC4 - num_position);
    tm1637_wait_ack();
    tm1637_write_byte(leddata[num] | (dp<<7));
    tm1637_wait_ack();
    tm1637_stop();
}
